["Current Server Version: v3.5.6a","*Click and drag edges to expand*","*Check the game description to see if this server is running the latest version*","*For bugs, suggestions, or questions, join the Admin House Community server linked in the game description.*","","[Version 3.5.6a]: 8/1/25","- Added the Mouse datatype to AHSL: Player:GetMouse()","  - Currently, only mouse properties are supported, not events","- Updated F3X exporting to use a server, your builds no longer have risk of getting stolen, make sure to update/install the 'Import from Admin House' plugin","","[Version 3.5.6]: 07/29/25","- Implemented :gearlibrary, a revamped gear selector that replaces :tools.","- The Gear Library includes search, categories, and names/descriptions for all gears.","- Implemented some minor changes to all gears.","- Gears without an icon now have an icon for the Gear Library.","","[Version 3.5.5d]: 07/26/25","- You can now only use ':give <plr> all' to one player at a time maximum, unless you're a Trusted user.","- Full revamp to how enforcement punishments are displayed to the user.","- Fixed a command error that occurs with the BossBar if you didn't provide the StartingDisplayName.","- 50M event and sale has ended.","","[Version 3.5.5c]: 07/16/25","- Minor Asset Library Changes","- New Features In AHSL:","  - Support to negative numbers","  - New BindingService (bind hotkeys to functions)","  - New GetRanks(Player) function","  - TextBox support added (:GetText() & .TextChanged)","  - Minor improvements to parity AHSL even more with LuaU","  - Fixed Critical Bugs","- Added very special part","- Added new commands: :setproperties, :localmusic, :resizescreenimage, :rotatescreenimage, :movescreenimage.","- Added a workaround for the broken F3X exporting, you must use the new 'Import from Admin House' plugin.","","[Version 3.5.5b]: 06/15/25","- Moved !redeem to the main game.","","[Version 3.5.5a]: 06/11/25","- Added :smoothcolorcorrection","- Added :camerasubject","","[Version 3.5.5]: 06/08/25","- MAJOR Asset Library Revamp: Categories, Filter & More.","- :submitasset has also been revamped.","- Added nullity command..","- Added new aliases to 13 commands.","","[Version 3.5.4a]: 06/07/25","- Fixed gifted permanent admin not migrating with the new internal saving system changes","- Fixed permanent admin system obtaining data before verifying all the gamepasses","","[Version 3.5.4]: 06/06/25","- New major feature: Admin House Scripting Language. Create mods for Admin House with advanced features. Use :ahsl to try it out.","- Revamped the Shop to support new products and features.","- Added gifting support to all gamepasses.","- Added likes and comments to the Asset Library.","- You can now sell assets for robux on the Asset Library.","- Added :mgrbossbar","- Added an elevator in the basement (WIP)","- Fixed a bug where dex users could manually activate secrets...","- :terrainpart is now limited to parts at height (y) ↓5000 and ↑-5000 to avoid the water pillar crash.","","(i think only 2 or 3 people got the secret normally dm daniel for badge restore)","(This update was developed on an external branch, all features from past smaller updates were paritied here.)","(Open a bug report if any added features are broken/missing.)","","[Version 3.5.3f]: 05/12/25","- Added :krdamage","","[Version 3.5.3e]: 05/05/25","- Added :setanimation","- Added :setanimationR15","- Added :resetanimations","- Added :dialog","- Credit to @v4mp13r2On1c for the dialog chat function.","","[Version 3.5.3d]: 04/19/25","- The bossbar will now reveal long names faster. (max of 3 seconds)","- Spaces in names won't have effects on the bossbar. (no shaking or sfx)","- Healthbars will no longer render above everything.","- Adjusted positioning of healthbars so they do not move weirdly.","- Fixed :tpforward, :tpback, :tpleft, :tpright, and :relativetp for R15, and added default values. (so you can just say :tpforward to teleport 10 studs.)","- Added :thru as an alias for :tpforward","","[Version 3.5.3c]: 04/19/25","- Added :healthbar (+ :unhealthbar).","- Added :bossbar (+ :unbossbar).","- Added :hidename (+ :showname)","- Credits to Undertale Test Place Reborn for the boss-bar style. (not sponsored)","","[Version 3.5.3b]: 04/14/25","- Critical patch that should fix some lag on loading builds with many meshes/textures/decals.","","[Version 3.5.3a]: 04/09/25","- New Script Library script: ExplosivePart","- Fixed the PartTouch and IndexTouch exe-components.","","[Version 3.5.3]: 02/21/25","- New custom gears: Flashlight, Large Flashlight, Floodlight, PT-LI4 Ray-N Flashlight, Battery, Pack of Batteries, and Box of Batteries.","- Removed GPR. (It was useless, anyways.)","","[Version 3.5.2d]: 02/17/25","- F3X now has a new tool to group objects into a folder/model.","","[Version 3.5.2c]: 02/15/25","- The G-P19 Plasma Pistol just arrived from Pentair Technologies today.","- This pistol is unique for having infinite ammo and a bloom system!","- This weapon is wielded by the Pentair Internal Security Force and is intended as a sidearm or in case of emergencies where no ammo is present.","","[Version 3.5.2b]: 02/14/25","- We got a message from Pentair Technologies today.","- According to them, 'the PT-17 Standard Issue Automatic Rifle' is now avaliable to all users...","- Maybe you should try giving it to yourself with the :give command.","- They'll be sending in more of their futuristic arms in the future, so keep a lookout.","","[Version 3.5.2a]: 02/10/25","- Updated the default build kit.","- Added dragging to the chat tags menu.","- Added new scripts to :scriptlist, DoorBrick, FlashingBrick, and GhostBrick.","- New custom gears: RussianRevolver, GoldPeak","- Added a portal to hell :fear:","","[Version 3.5.2]: 02/08/25","- Chat has been migrated to TextChatService","- Added a new chat-tag system that supports modern chat. Try it using !tag","- The abyss has arrived, the depths have opened up for new builds","- New products avaliable in the Shop: Tester Pass, Custom Tag","- Added a Rank Redeem game where you can change your role in the Administration Nation Group, join it with !redeem","- Added donations at the bottom of the shop.","- New ServerId system. Use the ServerId at the top left of your screen when making reports.","- Added in-game support tickets: Use !support or !ticket to join the ticket game.","- Added !abyssfx <on/off>","- Added :fplimbs and :unfplimbs","- Added !print, !bigprint, and !error","- Don't teleport while in the abyss, it may unleash something more terrifying than death.","- To whoever moved the trollium orb 1 stud to the left, please run :tp me 0,-4096,0","","[Version 3.5.1]: 01/06/25","- Removed :harrot","- Winter event ended","- Temporarily removed spooky portal, the new portal room is under construction","- Added :hidemap, :showmap, :audioclear and :hyperclear","- :clear, :pclear and :superclear will now remove SoundService audio","- Fixed ultra instinct not preventing jailing","- Replaced the flashbang with a new and enhanced version.","- Applied ultra instinct to all staff","- 📮","[Version 3.5.0b]: 12/21/24","- Minor fixes, changes, and enhancements.","- Added mega servers, run !mega to teleport to servers with up to 50 players","- Fixed star cannon portal not teleporting users","- Fixed ultra instinct gui not showing","","[Version 3.5.0a]: 12/21/24","- Minor fixes, changes, and enhancements.","- :dlight and :fix now toggles on/off the snow.","- Added util:username, util:displayname, and util:userid as Logic Utility aliases.","- Added plr: as an alias for player:","- Added :makec, :mc, :lc, :rc as aliases for :runc, :loadc, and :cmdbox","- Changed the placeholder text in :cmdbox","- Added a new error message if you did not use '@' when targeting a display name.","","[Version 3.5.0]: 12/20/24","- The Logic Update has arrived! Logic, Executor Parts, and so much more!","- Logic has been added! A lot has been added, so run the !logic command to learn more!","- This is a MASSIVE update, which required almost every command to be updated! We may have missed some, so if you have any issues report it as a bug in our communications server!","- The logic update changed some commands and deprecated their old format. Existing RunCs with those commands will still work, however it's recommended to migrate as soon as possible","- Executor Parts have been added! Run commands directly from parts, tools, and more! Run the !exeparthelp command to get started.","- 🎄 Winter has arrived! The basement has been decorated with christmas cheer, and the map is now quite cold.","- WARNING: The Effectpart command has been completely remade (it was completely broken already). Existing runcs with it will probably stop working, so migrate it now.","- :makepart will now have Smooth as the default surface on Top and Bottom.","- Trusted VIP Owners now have access to DEX, an advanced Roblox Studio UI for creation. Run :dex in your VIP Server if you are TRUSTED. NOTE: Abuse of Dex will result in moderation.","- Added :localmovepart :linearvelocity, :angularvelocity, :smoothblur, :smoothscalemodel, :settexture, :cleartextures, :setvar, :savevar, :if, :waituntil","- New sound filters: Distortion, Echo, and Tremolo. Access them with their respective commands.","- Sound Filters will now clear upon music change.","- Added :fixmusic which sets pitch and volume to 1 and removes all sound filters.","- Added the Script Library, which includes 5 scripts that can be placed into parts! See the list with :scriptlibrary","- Leaderboard Stats have been added! Added :makestat, :removestat, :clearstats, and :setstat! :addstat and :subtractstat have been removed, because you can already make them with logic!","- Added events! The only events you can use right now is :playeradded and :playerremoved, which runs a command every time a player joins. You can use :clearevent or :clearevents to disconnect them. More events will come later!","- Added :renametool, :toolicon, :removeheldtool, and :spawntool.","- Added the Speed, Weight, and FadeTime parameters to :animation","- Added :animspeed and :animweight for animation customization.","- Replaced F9 build load logs with Adonis logs; you can now view build load logs in :buildlogs","- Added a client-side log cache which can be opened even if the server is lagging. You can access them in the 'Logs' menu that appears if you are lagging.","- You can now gift perm to other players in the shop menu! If you are a perm admin, use !giftperm to open the shop menu.","- Added a new autocomplete feature to :cmdbox, which shows informations on commands/player finders/logic constructors as you type them based on the Roblox Studio autocomplete. Keep in mind that this is optimized for PC and can be toggled in settings.","- Added new user-settings which you can configure in !settings","- Audit Logs are now viewable in Admin House. You can view staff actions in !auditlogs.","- Replaced the MaterialsPallete in the Model library with a new contribution made by @gronk64","- Added :blogs, :clogs, and :jlogs as aliases for :buildlogs, :chatlogs, and :joinlogs","- Minigun will now do more damage, however it will slow your speed when held, making it a powerful yet heavy weapon to use.","- ASSET LIBRARY HAS BEEN ADDED! Trusted users can publish builds or runcs for everyone to use using :submitasset, and players can use :assetlibrary to load them! (To load BUILDS from asset library, you must be in a VIP server and be the owner)","- New VIP owner commands: :unlockmap, :lockmap, :addsecureparts, :resetpads, :regenkit","- New trusted command: :votekick, which allows you to vote to kick a player.","- Added :updatelogs as an alias for :gamechangelog","- Added :rotatemodel, :enablelights and :disablelights","- Added :dopin, :kaddah, :daniel, :gusta, and :derpy","- Added !starcannon, only useable by those who are worthy.","- Added a new portal - Star Cannon Baseplate Game (Esoteric)","- Halloween 2024 game updated to Event game","- VIP owners can now summon a certain pink starfish to consume the map.","- Added :tph as an alias to :tphouse","- New custom tools: CoinFlip, Bandage, PackageBandages, Medkit, ShieldBlitz, Adrenaline, ImpulseGrenade, TimeGrenade, ReconGrenade, RecallPotion, SCP-207, Anti-207, and WaterBottle.","- Added new Roblox gears as custom tools: DaggerOfShatteredDimensions, ZombieStaff, ScrollOfSevenless, KOSSGustHorn, PhoenixPet, IceBird, WaterCrossbow, LaserFingerPointers, BatKnightBatSword, BeeHive, RainbowMagicCarpet, StopHittingYourself, FuseBomb, KyloLightsaber, BanHammer, SubspaceTripmine, Boombox, GravityCoil, SpeedCoil, TelamonsterTheChaosEdge, UpperSword, AzureDragonMagicSlayerSword, Bloxiade, WitchBrew, ChocolateMilk, BloxyCola, GoalaCola, Redblox, Cake, Cheezburger, CandyBar, Pizza, Taco, Watermelon","- Don't ever do that again.","","[Version 3.4.6]: 11/20/24","- The VR Command Bar button has been updated into a VR Utilities menu for ease of access.","- Added Teleport Tool to custom tools.","- Added mobile, controller, and VR support to the Gravity Gun and Supercharged Gravity Gun.","","[Version 3.4.5b]: 11/19/24","- Rules have been updated. Make sure to read the !rules again.","","[Version 3.4.5a]: 11/16/24","- Due to old chat breaking on VR, :cmdbar has been added, and VR players will now get a button to open the cmdbar.","","[Version 3.4.5]: 11/16/24","- Anti-lag has been disabled due to complaints.","- Camera will now stop shaking upon respawn or with :resetview","- New custom tool: Dice","- Changed animations and sounds for 357.","- You can now aim the 357 with Q.","- Replaced M4A1 with an enhanced version.","- Replaced M9 with Glock-17.","- The Glock-17 can enter Rapid-Fire mode with Q, which reduces accuracy.","- Replaced Sniper with AWP.","- AWP scope can be used with Q.","- Replaced Minigun with an enhanced version.","- Improved the Snake Rifle and Snake Minigun.","- Replaced GoldM4A1 with HyperM4A1.","- Replaced SuperScatter with HyperSPAS-12.","- Removed ScatterGun.","- Removed Magnum.","- Fixed the expanded periastrons causing some keys to be invalidated.","- The modified vanilla periastrons now show ability buttons on mobile.","- Proofread all tooltips for custom tools.","","[Version 3.4.4b]: 11/13/24","- Fixed :tphouse","","[Version 3.4.4a]: 11/13/24","- Tweaked the anti-lag","- Anti-lag will no longer apply to Trusted user's builds.","- Added :antilag for VIP server owners.","","[Version 3.4.4]: 11/12/24","- New anti-lag system by GustaGamerMTW","- Improved and optimized anti-crash-mesh.","","[Version 3.4.3a]: 11/10/24","- Improved error handling for :makemeshpart","- You will be notified if your build contains MeshParts.","","[Version 3.4.3]: 11/10/24","- The Halloween event has ended, the map is back to normal.","- You can access the Halloween maps in the secret room.","- Badges from the Halloween event are no longer obtainable!","- :pclear will now delete tools and accessories.","- Trollium cube is now asleep.","=============================================================","* I got this update out fast just so you can get the normal map back before I might have to go. This may be my last update.","* Thanks for playing the game, I hope you enjoyed the content I've created for the game in the past few months. Thank you.","* One last note: I simply want to apologize. I hope to be forgiven so I can rejoin this community.","* Thank you for the memories you all have given me in these 4 long years.","- Dolphin","=============================================================","","[Version 3.4.2b]: 11/2/24","- Added :emit command, emits particles once","- Added :weldtocharacter command, weld parts to a bodypart of your character","- Added Enabled parameter to :effectpart","- :breakwelds will now break welds created with :weldtocharacter","- Added :partlookat, makes a part face in the direction of another part/player.","- Mouse icon will now reset on spawn.","","[Version 3.4.2a]: 11/1/24","- Fixed :teleportpads","- Fixed :sunrays","- Made :setmesh more error-friendly.","- Improved all Adonis Command Errors to output to the Developer Console.","- Improved other Adonis error messages to be more friendly to new players. (for no permission and invalid command)","- Added anti-noob error messages (e.g trying to use HD Admin prefixes and commands)","- Added :floatingimage and :unfloatingimage","- Fixed the Dialog Tool for mobile users","","[Version 3.4.2]: 10/31/24","- 🎃 PHASE 3 OF HALLOWEEN EVENT IS HERE!","- 1 new badge added","- #EISS_Servers_Online","- We have a lot of new features thanks to contributions from a new developer candidate, GustaGamerMTW! Below are their features they added.","- Added :setmesh, :delmesh, :meshpart, :shakecamera, :timeshake,","  :stopshake, :mouseicon, :unmouseicon, :effectpart, :cleareffects,","  :setsurface, :setdecal, :cleardecals, :pointlight, :spotlight,","  :surfacelight, :clearlights, :spawnc, and :teleportpads","- MeshParts are now fully savable. However, MeshParts take a while to load depending on their complexity due to collision calculation. Builds with many MeshParts will take a lot longer to load.","- Added the Dialog Tool to custom tools, which lets you create dialogs.","","[Version 3.4.1b]: 10/17/24","- By popular demand, :skybox, :screenimage, :suntexture, :moontexture, :maketool, and :faceimage now support Image IDs alongside Decal IDs.","","[Version 3.4.1a]: 10/17/24","- Optimized the trees since they were causing major lag issues","","[Version 3.4.1]: 10/15/24","+ 🔥🎸💀🎸🔥","   - Map updated to phase 2 of the spooky update.","   - Added 4 secret badges.","   - :spookylighting now has a phase parameter.","   - 🔥🔥🔥💀🔥🔥🔥","","[Version 3.4.0]: 10/1/2024","- [NOTE] This update was released in 3 parts, and this is the final part and full release. All 3 parts have been merged into one changelog, scroll down for Part 3's new features.","- Part 1 originally released on 9/1/2024","- Part 2 originally released on 9/7/2024","----------------------------------------","+ Added in-game Private Servers.","   - Accessible through !privateservers","   - Create and join in-game private servers","   - Free and unlimited, but there are no owners.","+ New Camera Commands","   - New commands: :lockviewcam, :flviewcam, :smoothviewcam, :sfviewcam","   - Prevent camera movement and set a custom rotation.","   - Create more advanced cutscenes.","+ ScreenImage Is Back","   - New commands: :screenimage, :itransparency, :icolor, :unimage","   - Place an image over any player's screen.","   - Add an index and a layer to customize screen effects.","   - Customize images in real time to make cool effects.","+ Rules have been implemented","   - Admin House has an official in-game rulebook.","   - If you don't follow these rules, you might be warned or even banned!","   - Read the rules in !rules","+ The Model Library","   - A library of curated builds made by staff members and trusted users.","   - Insert any model in a Private Server with :insert","   - View the full list of models in :modellibrary.","+ New Part Indexing Commands","   - :makegroup - Group parts into a model. Allows mobile users to group parts.","   - :ungroup - Separate grouped parts.","   - :clonepart - Duplicate parts. You can assign a second index for the duplicated parts.","   - :damagepart - Make parts deal damage. Make more complex abilities.","+ Sound Filters Are Here!","   - Audio has never been more customizable.","   - You now have 5 new customizable sound filters that you can apply to songs.","   - :reverb - Reverberates audio, simulating the effect of bouncing off walls in a room.","   - :equalizer - Controls the volume of incoming audio across three frequency ranges.","   - :chorus - Makes the audio more voluminous by simulating multiple voices playing the same part.","   - :pitchshift - Adjusts the pitch of a sound without changing it's playback speed.","   - :flange - Creates a sweeping or swooshing effect on a sound.","+ Lighting Is Now Fully Customizable!","   - All properties and effects of the game's lighting can now be changed with commands.","   - This means that the mood of the scene is now 100% customizable. and can fit nearly every environment.","   - Smooth versions of these commands will be added in a later update.","   - List of new lighting commands: :atmosphere, :bloom, :blur, :colorcorrection,","\t- :colorgrading, :depthoffield, :colorshiftbottom, :colorshifttop, :envdiffusescale,","   - :envspecularscale, :shadowsoftness, :geographiclatitude, :exposure"," + 💀🎺","   - New commands: :defaultlighting, :spookylighting","-- Other features --","- New command: :smoothspeed","- New command: :timenotify","- New command: :invistool","- New command: !joinserver","- New command: !isadmin","- New command: !getsong","- New tools: Drag Sun, Drag Moon.","","[Version 3.3.18]: 8/19/24","- Replaced the R6/R15 auto-rig.","- MAJOR: Fixed the R6 accessories bug by using a new R6 rig.","- Special Thanks to @ceat_ceat for the R6/R15 converter.","- The new rigs may have bugs, so please report the bugs to us.","","[Version 3.3.17]: 8/11/24","- Added new utility tools: Edit Custom Material, and Indexing Tool."," These new tools are based off of an old gear from 2012, which has been modified to work and fit standards."," You can get them in :tools","- Renamed 'Vehicle Seat Configurator' to 'Edit Vehicle Seat'","- Updated the Vehicle Seat Configurator tool with sound effects and accurate colors.","- Expect some more content updates soon!","","[Version 3.3.16]: 8/9/24","- New commands: :allowReset, :allowShiftlock, :respawnTime (vip servers), :toolsEnabled,","  :disableDropping, :enableDropping, :forceUnequip, :forceDrop, :forceEquip, :setCameraLimit","- New Terrain commands: :wcolor, :wreflectance, :wtransparency, :wavesize, :wavespeed, :resetterrain","- Trusted users can now bypass fillterrain limits.","- New parameters added to :explodeat to allow more customization. See them in :cmds","- The Vehicle Seat Configurator tool will now replicate to the server.","","[Version 3.3.15]: 7/25/24","- The 2022 materials have been added as seperate Custom Materials so you can have both in the world at the same time. There are a total of 26 2022 materials added. They are listed in !matlist in a third category.","- New custom materials: StoneBricks, StylizedGrass, PaintedWall, FnafFloor, FnafWall, CeilingTiles, VintageTiles, CircleTexturedMetal, IndustrialWalls, MetalGrid, RibbedChippedMetal, ScuffedIron, SpaceCrate, StorageContainer, UsedStainlessSteel, VentedMetalPanels, VerticallyLinedMetal, GridPBR","* See all custom materials in !matlist","* You can use :loadmaterial or :setmat to place a part with a custom material.","","[Version 3.3.14]: 7/19/24 [MAJOR UPDATE]","- Dynamic lighting (aka. Future Lighting/RTX) has been added to the game.","- The game's lighting has been updated to the most modern version.","- This will allow builds to be much more realistic, as all lighting now has dynamic shadows.","- NOTE: Older builds will be affected by this, and may look weird. Use the Lighting Tool in F3X to adjust the light objects, or remove all of them and place lights from scratch.","","[Version 3.3.13]: 7/17/24","-- The Future Is Smooth | Part 1 --","- Many new existing commands now have Interpolation variants! You can now smoothly change the music, the lighting, the clouds, etc."," * For a full list of Smooth command variants, run :cmds and search up 'smooth'","- Added :terrainpart allowing you to replace parts with terrain (to create robust 'terrain saving' and more freedom.)","// The Future Is Smooth Part 2 will be coming later, with features like more lighting effects, FogV2 (Atmosphere) and more Music Effects...","","[Version 3.3.12]: 7/13/24","- Added :vanillaf3x (VIP Servers Only)","- Added :removetool <player> <toolName>","- Added :noface","","[Version 3.3.11]: 7/12/24","- Added :exacttp","- Added :errornotify","","[Version 3.3.10]: 7/10/24","- Added :harrot","- :unadmin is now avaliable for VIP server owners, allowing you to temporarily remove admin from users.","- PART INDEXING v1.0 HAS BEEN RELEASED, YAY!","  Part Indexing is a new set of all-new commands that revolve around running commands on parts.","  You can run the :makepart <index> command to make a part, and index it with <index> (a number from 1-100000)","  You can then run various commands to edit and manipulate parts, all with commands!","  There is a lot you can do, so check :cmds and !tweenhelp for all new commands and assist.","  List of ALL commands related to part indexing: :makepart, !tweenhelp, :movepart, :resizepart, :rotatepart, :setanchored, :setcollision, :setmassless, :hasshadow, :setshape, :editphysicalproperties, :weldmodel, :breakwelds, :deletepart, ","  :unindex, :setmaterial, :settransparency, :setreflectance, :explodeat, :partaudio, :unpartaudio, :applyvelocity, :moveparttoplayer, :disableparticles, :enableparticles, :movemodel,","  :scalemodel, :indexmodel, :indexall (VIP only)","","[Version 3.3.10_BETA2]: 7/8/24","- Custom-tools re-added to the game. We will continue working on the full version of 3.3.10 and Part Indexing.","","[Version 3.3.10_BETA]: 7/8/24","- Added :harrot","- Part Indexing has been added. (BETA) This was released early due to the required emergency patch. The full version has much more features and will be released later.","- EMERGENCY PATCH: All custom gears have been disabled. They will be brought back when it is safer.","","[Version 3.3.9]: 7/7/24","- Changed some of the new player finders to be more user-friendly. (Old ones will remain in the game for compatibility. See !usage for changes.)","- Patched the #inf playerfinder exploit.","- Brought back :ggrav and added :resetgravity","- Added !getpos and !getfullpos to get your character's current position","- New commands: :terrainblock, :terrainball, :terraincylinder, and :terrainwedge. These commands allow you to create reigons of terrain. (Note: They are limited in public servers to prevent abuse.)","- New commands: :removeLegs, :removeLLeg, :removeRLeg, :removeArms, :removeRArm, :removeLArm, :removeTorso, :removeHead, :removeRootPart, and :removeHumanoid","- Added <force> argument to :fling, and showed the default strength for :superfling","- Added :faceimage","- New player finders: hpabove:NUMBER and hpbelow:NUMBER which you can view info on in !usage","- Targets system has been reworked and it now supports multiple players! Added :target, :removetarget, :targets, and :clrtargets for the new system. 'target' has been changed to 'targets' to accomodate. :settarget and 'target' will remain for compatibility.","- Added :makevenomshank <r> <g> <b> and :maketool","- Added :suntexture <decalId> and :moontexture <decalId>","","[Version 3.3.8l]: 7/6/24","- Added :sn <message> and :sh <message>","- Added :swapteams <player1> <player2>","- Added several player finders: @DISPLAYNAME, findhat:HATNAME, and hastool:TOOLNAME (see !usage for more information)","- Player targeting has been added. You can set a single player as a target with :settarget, and that player will be chosen when using the 'target' player-finder.","- VR Support has been added to the game via Nexus VR Character Model. You can now play Admin House! in VR. (Note: VR is only supported on R15.)","* Currently, targetting only supports 1 player at a time. Supporting multiple players will be coming soon.","","[Version 3.3.8k]: 7/4/24","- The RollOffMinDistance and RollOffMaxDistance properties in :charaudio will now save properly in F3X.","","[Version 3.3.8j]: 7/3/24","- Channels have been added for :music which allows you to play up to 10 unique audio at once!","- Indexing has been added to :charaudio which allows you to make soundgroups that you can specify removal with :charaudio!","- RollOffMin and RollOffMax have been added to :charaudio which specifies the distance the sound begins to fade out, and the distance the sound cannot be heard.","- Removed the half-second delay from :music for more accuracy in command scripts.","* If you find any issues or bugs with Channels and Indexing, please submit a bug report in the AHC.","","[Version 3.3.8i]: 7/2/24","- Added :partclear (aka :pclear) for VIP server owners which clears all placed parts.","- New aliases for :clearteams (:clrteams) and :removeteam (:delteam)","- 3 new custom materials; ElasticlessRubber, which is Rubber (material with most friction) but no Elasticity, BouncyBall which is a material with high Elasticity and FrictionPad a material with high Friction","","[Version 3.3.8h]: 7/1/24","- Anti-Mesh V3 has been released, which should be fully functional and will remove a lot of mesh-based crashes.","- This anti-mesh comes with an ID blacklist. You can join the AHC if you want to report an abusive crash mesh.","","[Version 3.3.8g]: 7/1/24","- Staff and trusted users now have both part-count and anti-abuse bypass.","- Implemented new anti-mesh-crash made by @funzysdeath, report any issues in AHC.","- Added :makespawnlocation (aka :newspawn) which allows you to make team spawns.","","[Version 3.3.8e]: 6/29/24","- Added :lockbuilds and :unlockbuilds for VIP server owners. These commands prevent others from selecting your build if you are making events.","- New player finders: perms, nonperms, and noteams (see !usage for more information)","- Fixed %TEAMNAME not appearing in !usage","- Added playOnRemove argument to :charaudio","","[Version 3.3.8d]: 6/29/24","- :newteam, :removeteam, and :clearteams are now avaliable and filtered on public servers.","- Added PartType argument to :loadmaterial","- Added :tpleft and :tpright","- New staff member","* Coming soon: :fillterrain, :fillterrainplr","","[Version 3.3.8c]: 6/29/24","- CUSTOM MATERIAL SAVING ADDED. This is new so it may have bugs. (Build saving isn't modified with this method so no data loss will occur)","* You can now spawn, use, and save ALL custom materials with the :loadmaterial command (case sensitive)","* List of all custom materials spawnable with :loadmaterial (hover mouse to expand): Asphalt, Basalt, CrackedLava, Glacier, Ground, Ice, LeafyGrass, Limestone, Pavement, Rock, Salt, Sandstone, Snow, 1950sFabric, ArcadeCarpet, BackroomsRoof, BackroomsWallpaper, BathroomTile, BrushedStainless, Cardboard, ConcreteWet, CountertopsGranite, FakeGrass, Flagstone, FlagstonePuddle, Gravel, GravelPuddle, GravelSmall, Grid, MarbleTile, MudPuddle, Mulch, PoolTile, SolarPanel, Wallpaper, WoodFloor, WoodFloorHerringbone, WoodFloorRough","","[Version 3.3.8b]: 6/28/24","- Made :fixbp apply to the house and obby","- Made some custom tools droppable","- Added new arguments to :rope for contraption builders","- Added :spring, :torsionspring and :rod","- Added :relativetp, :tpforward and :tpbackward","","[Version 3.3.8a]: 6/28/24","- Added :modernmaterials [on/off] (might look weird on the house)","- Added :loadmaterial (can place a part with any Material, including ones inaccessible in F3X like custom materials)","- Added some new custom materials","- For those car build makers, we've added :makevehicleseat so you can easily configure vehicle seats.","- Made :fix reset clouds, globalwind, and modernmaterials","* List of all custom materials spawnable with :loadmaterial (hover mouse to expand): Asphalt, Basalt, CrackedLava, Glacier, Ground, LeafyGrass, Limestone, Pavement, Rock, Salt, Sandstone, Snow, 1950sFabric, ArcadeCarpet, BackroomsRoof, BackroomsWallpaper, BathroomTile, BrushedStainless, Cardboard, ConcreteWet, CountertopsGranite, FakeGrass, Flagstone, FlagstonePuddle, Gravel, GravelPuddle, GravelSmall, Grid, MarbleTile, MudPuddle, Mulch, PoolTile, SolarPanel, Wallpaper, WoodFloor, WoodFloorHerringbone, WoodFloorRough","","[Version 3.3.8]: 6/27/24","- Decals and :skybox have FINALLY been re-enabled in public servers.","- Staff are now immune to anti-abuse","* Please report all NSFW decals to Daniel or Dolphin, or join the AHC server and report in #player-reports","","[Version 3.3.7f]: 6/26/24","- Limited :srayintensity and :srayspread to prevent breaking the lighting; except in VIP servers.","","[Version 3.3.7e]: 6/26/24","- Added :sunrays [on/off, default is on]","- Added :srayintensity","- Added :srayspread","- Added :globalwind [affects dynamic clouds and particles]","* Note: SunRays are on by default. SunRays are NOT visible to Mobile users.","","[Version 3.3.7d]: 6/26/24","- Added :sunsize","- Added :moonsize","- Added :starcount","","[Version 3.3.7c]: 6/25/24","- Moderation utility patch","","[Version 3.3.7b]: 6/24/24","- Added :boxhead","- Removed a custom gear that caused a permanent health-drain glitch","","[Version 3.3.7a]: 6/24/24","- Console utility for finding crashers","","[Version 3.3.7]: 6/23/24","- Adjustments to moderation (rank changes, permission adjustments)","- Adjustments to custom tools (removals, modifications)","- :songpos command added; adjust the position of music","- New arguments to Charaudio; change loop, volume, and pitch","- Over 40+ new custom gears added, available with :tools","- Changed default clocktime to 12","- Changed default skybox to modern (you can access the old one with :unskybox)","- Added volumetric clouds, accessible with :clouds [on/off]","- Added :ccover, :cdensity and :ccolor for modifying volumetric clouds","- Added :noregen, allows you to remove Roblox health regen from a player","- Added :bpfix to fix baseplate conveyorbelt glitch","- Banned a potentially abusive gear","- Fixed a bug where the nuke timer gets stuck on screen","- Nerfed the custom crimson peri's Pillar Wave ability (e)","- Added lore description to the Prototype NEXON Rifle","- Additional fixes, changes, and additions","","[Version 3.3.6]: 6/21/24","- Game development team has been handed to Administration Nation.","- Removed :place.","- Added owner-only temporary moderation.","- Custom Audio is now Playable.","","[Version 3.3.5]: 2/21/24","- Free VIP servers.","- Fixed :uncharaudio.","","[Version 3.3.4]: 9/9/22","- Banned a crash-inducing gear.","- Added extra text filtering to logs.","* Expect major updates to the game soon!","","[Version 3.3.3]: 12/21/21","- Fixed noclip.","- Fixed :hat not working with shoulder accessories.","","[Version 3.3.2]: 11/20/21","- Fixed :gear search not working.","* Big updates to follow.","","[Version 3.3.1]: 7/10/21","- BETA testing (still a WIP and will be refined) of the new anti-lag-build feature has been turned on for non-VIP servers.","  Please report bypasses/mistakes to Kaderth or the community server (give exact name of build & username of owner of build).","- Note: For those not in the community server/not aware, most development is currently focused on the new admin commands (hence the lack of updates); join the community server for updates on that.","","[Version 3.3.0]: 3/5/21","- Fixed F3X bug where cloning yourself/someone else might kill you/them.","","[Version 3.2.9]: 2/28/21","- Fixed a bug that let people bypass build lock by grouping parts.","- Fixed a bug where you couldn't delete some accessories.","","[Version 3.2.8]: 2/28/21","- Fixed perm users occasionally being able to bypass :slock.","","[Version 3.2.7]: 2/8/21","- TShirts loaded from builds no longer show on non-VIP servers. If you have any TShirts saved in your builds, they will show up as blank if loaded into non-VIP servers.","  However, that does not mean they are deleted. They'll just only show if loaded in VIP servers. This was done to prevent NSFW images from being shown.","  In the future, when a solution is added, decals, textures, tshirts, etc. will be restored in non-VIP servers.","  Note: TShirts added via the :tshirt command still show (this only affects TShirts from saved builds).","- Enabled the new bubble chat.","","[Version 3.2.6]: 12/23/20","- Fixed bug with the :talkcolor command.","","[Version 3.2.5]: 12/6/20","- Fixed a bug that caused some saved F3X builds to not load properly (gave a corrupted error).","","[Version 3.2.4]: 11/2/20","- Added a build-locking feature to F3X (open F3X and click the lock button in the bottom right hand corner to access it).","  Allows you to configure who can clone/save your builds (note: players can still edit/delete your builds; they just can't clone/copy them).","  WARNING: For VIP servers only: if you leave without manually deleting your builds, they will become unlocked for all to copy/clone.","           On public servers, your builds are automatically deleted when you leave, so this isn't a problem.","\t\t\tIn the future, there may be an option for you to set your builds to automatically delete when you leave VIP servers.","","[Version 3.2.3]: 8/27/20","- Mobile GUI resizing bug fixes","","[Version 3.2.2]: 8/23/20","- Lag has been slightly reduced for F3X (note: this lag only happened on mobile devices based on my tests).","- For mobile users, you may still get a bit of lag when you equip F3X, but it should go away quickly (and it should only happen the first time you equip F3X).","- Luckily, you shouldn't get lag when others equip F3X (which used to be a thing?).","- Fixed some kill brick glitches.","","[Version 3.2.1]: 8/22/20","- R6 character scaling fixes.","","[Version 3.2.0]: 8/19/20","- Updated to the latest version of Adonis (see :changelog for a complete list of changes). Some changes include a patch to name spamming (e.g. :gear all,all,all,all,all hyperlaser), pages for list windows (say :cmds for an example), and new commands (like :displayname).","- :flynoclip now works on mobile.","- Players are now restricted to having a limited number of each building tool to prevent spam/lag.","- Lag & bug fixes (like music cutting off).","","[Version 3.1.1]: 8/14/20","- Skybox commands have been temporarily removed on public servers. They will be brought back later when it's safer to do so. Note: skybox commands still work on VIP servers.","- :fly should be slightly better on mobile.","  Also, you can change your flight speed by doing ':fly <player> <speed>' (speed is similar to walkspeed) anytime you want.","","[Version 3.1.0]: 8/14/20","- Enabled auto cleaning of more objects. If this breaks anything, let me know.","- The feature to load decals has temporarily been removed on public servers. Saved decals are still safe; they just won't load unless you're in a VIP server.","","[Version 3.0.9]: 8/13/20","- Fixed a bug that contributed to some(?) server lag for servers that were up for a long time.","- Temporarily reduced the max number of bots per player from 15 to 10 (this will probably be changed when the new bot command is released).","","[Version 3.0.8]: 8/11/20","- Fixed the F3X saving issue where you'd get a message saying your session belonged to another server.","- Autosaves are less buggy now.","- :time now accepts strings in the format of HH:MM alongside numbers. Note: ':time 7.5' is the same as ':time 7:30'","","[Version 3.0.7]: 8/10/20","- Added the :unloadb <name?> command. Run it to clear any loaded builds corresponding to <name> that you've loaded into the game.","  If you do not provide a name, all the builds you've loaded into the game will be cleared.","  :delb deletes the build from your saved slots, but it does NOT actually remove any parts from the game","  :unloadb actually removes the build from the game, but it does NOT delete the build from your saved slots","- Fixed a bug that prevented new players from saving F3X builds.","","[Version 3.0.6b]: 8/3/20","- Removed the <hidehint> parameter for :runc since it was causing some issues w/ command names that were more than one word.","  The running command hint message still shows before the command runs.","","[Version 3.0.6]: 8/2/20","- Fixed issue where certain characters wouldn't be completely locked upon spawning.","- Fixed a F3X auto-save loading bug.","- F3X saving change: Previously, if a part couldn't be saved (e.g. a part that got deleted), the game would error and not save anything at all. Now, even if certain objects can't be saved, the rest that can will be saved.","- All (newly) saved characters (via F3X) should load properly now (previously, some characters would look blocky because they contained meshparts that didn't load properly).","- Fixed issues with grouping/ungrouping in F3X.","- Fixed !newserver teleporting to the same server.","- Fixed !follow.","- Made some adjustments to the anti-abuse system (more to come later).","- :logs has more text filtering now.","- The command box text box now resizes correctly. Text no longer goes outside the box (there's a scrollbar now).","  Additionally, text now starts from the top left.","- Added the :textw <player> <message> command (or :textwindow). Use it to display (long) messages to people. It uses a resizeable scrollbar,","  so you can guarantee people will be able to read your entire message.","- Added the :stopc <name?> command. Use it to stop running any of your saved commands (matching <name>","  or all of them if no name is provided) that are currently running and may run forever because they are looped.","  Ex: if you have a saved command named 'testloop' that is ':wait 5|:m hi|:runc testloop', it will run forever.","  However, now, you can run ':stopc testloop' or just ':stopc' (for all saved commands) and the saved command(s) will stop running.","- When running :runc, the 'Running' hint will now display before the command starts running (instead of afterward).","  [removed, see 3.0.6b] To disable the 'Running' hint (since it can get annoying if you loop saved commands), run ':runc <name> true' (see :cmds for more info).","- Most character customization commands have been updated.","  gear, hat, pants, shirt, tshirt(new), head(new), emote(new), face, package/bundle, animpackage(new) now take ids or strings/names.","   - If you do not provide an id to these commands, the game will attempt to search the roblox catalog for them and give you the first item.","     Examples:","        ':gear me hyperlaser' -> gives you the hyperlaser gun","        ':hat me fedora' -> gives you a fedora","        ':gear me linked' -> gives you a linkedsword","        ':package me skelly' -> turns you into that skeleton package","  lleg, rleg, rarm, rleg, torso, climbanim(new), idleanim(new), walkanim(new), runanim(new), swimanim(new), fallanim(new), jumpanim(new) have been updated as well.","   - These commands, however, only take ids (can't search).","- Bighead & smallhead have been fixed. Note that they may be slightly off on R6 characters.","- The following commands received adjustments (see :cmds for more info): :clearguis, :fix, :info, all lighting commands (:fog, :freaky, etc. -- some have better descriptions as well).","","[Version 3.0.5]: 7/7/20","- Fixed some map exploits.","- F3X should now run a bit faster when dealing with large parts.","","[Version 3.0.4]: 7/3/20","- Fixed a mobile bug where your camera would get stuck if you closed an Adonis gui you in the middle of resizing.","","[Version 3.0.3]: 7/2/20","- Fixed the reset admin button getting stuck.","","[Version 3.0.2]: 7/2/20","- Added a search bar to the save/load build guis for F3X.","- Added a search bar to the save/load guis in the command box.","- The F3X save/load build gui now lists your builds in alphabetical order.","- The command box save/load gui now lists your commands in alphabetical order.","- Added auto-saving for builds. Every time you leave the game, a copy of everything you've built will be saved.","  You can only access this slot through the F3X load button (it will always be the top slot).","  There is only one slot, and it gets overwritten every time you leave a game where you have built something","  (so if you didn't build anything in a game, the slot will NOT be wiped).","  Only things you built/cloned will be saved. Building kit items will NOT be auto-saved unless you cloned the items.","  Try not to rely too much on this auto-saving; always save your builds.","- Fixed saving issue where saving very large builds would cause the saving to hang forever.","- Added the :f3x command -- use this when you ONLY want the F3X building tools (and not the classic ones).","- Added the :loadc / :openc <name> command -- this opens a new command box and loads the saved commands under <name>","  This simply opens the command in the commandbox -- it does NOT run the command like :runc.","- The camera no longer moves around when you resize Adonis guis on mobile devices.","","[Version 3.0.1]: 6/27/20","- Fixed some mouse bugs dealing with gears.","- F3X Roblox Studio exporting has been brought back.","  NOTE: F3X cannot export certain objects from the building kit (like meshes and the selection boxes).","  This will be fixed in a later version.","","[Version 3.0.0_BETA]: 6/22/20","- New anti-abuse system - the new system is still in BETA, so adjustments will be made.","  The new system is pretty sensitive to abuse, so spamming will only make things worse.","- Small lighting changes - the game should look more vibrant now.","- Building kit revamp - everything in the new building kit will save.","- Fixed some saving issues where R15 characters wouldn't save properly (partial fix - a more complete one will come later).","- Cooldown for admin reset & building kit reset buttons.","- If you drag a building kit item (that isn't cloned) outside of the building kit area, it will no longer disappear","  when the reset button is clicked.","- Nonadmins no longer spawn in user-made spawnlocations (they always spawn at the regular admin house spawns now).","- VIP owners now have the owner role in their VIP servers. Right now, this means a few extra commands (more VIP support will come later).","- Command rewriting: about 25% of the commands have been rewritten to be less buggy and more user-friendly.","  You may notice that some commands give better information on how to use them if you type them incorrectly.","  Over the next few updates more and more commands will be rewritten/fixed.","- Waypoint and camera saving.","- Better GUI support for very small devices (they scale better now).","- There is now a 10,000 part limit for building (per person). Once you exceed this limit, certain parts of yours will automatically disappear.","  When you reach 9,500 parts, you'll receive a warning. Run :partcount for a detailed list of where you're at. Note: These numbers may change.","  Also, your builds now delete when you leave to prevent server lag.","- Both the new anti-abuse system and part limits are disabled on VIP servers.","- List of new commands:","  :resetlockmessage (vip servers), :wait, :hcpm, :aborthc, :tmpm, :tn, :tnpm, :hpm, :talkcolor, :chatnotifyc","  :stopanimate, :unafk, !follow, !newserver, :delcam, :forceviewcam","","[Version 2.4.5]: 6/6/20","- Added in unlimited command saving.","  Previously, only build saving was unlimited, but now both are.","","[Version 2.4.4]: 4/25/20","- Fixed certain F3X bugs with modifying unlocked characters","- The scrolling list for saving/loading builds should scroll correctly now","","[Version 2.4.3]: 4/24/20","- Fixed a bug where you couldn't teleport players who were sitting down in a seat","","[Version 2.4.2]: 4/23/20","- Fixed F3X btools gui scaling on mobile","- Fixed F3X multi-select not showing up on some mobile devices","- Fixed some issues where things like god-ed clones wouldn't save","","[Version 2.4.1]: 4/21/20","- Fixed shift lock/mouse cursor bug","- Removed :insert","- You may now use classic btools on your own character when it's unlocked","","[Version 2.4.0]: 4/20/20","- Added build (F3X) save/loading (mobile-compatible).","  To save a building, select the items you want to save in F3X (for mobile, use the rectangle select), and press the save button.","  To load a building, press the load button in F3X. You can also use the commands loadb/delb (see :cmds for more info).","- If you didn't know, in F3X, you can toggle between selecting parts/groups (e.g. selecting an entire character vs an arm)","  by the Shift+T hotkey or by pressing the pointer icon in the bottom left hand corner.","- Fixed F3X rectangle selection not accurately capturing input","- Testing 8 player servers","- Added the :gamechangelog command - use this to view the entire update list and check if a server is running the latest update","  (check current version in description and compare it to the version in the game changelog)","- Fixed certain objects not being able to be selected","- All characters are now locked by default (use :unlock to unlock them) - they are automatically unlocked when :clone'd though","- Added a cooldown to superfling, smite, and fov","- Fixed Adonis not warning you when you've typed an invalid command.","- Update to the latest Adonis version (see :changelog for Adonis-specific updates)","","[Version 2.3.1]: 4/2/20","- Cooldown adjustments","- Only one :chat window can exist at a time","- Fixed command box & other guis disappearing when you reset","- Tools are now transferred when :r6/:r15 are used","- Fixed cross-server chat not filtering chat","- Fixed classic btools not working after :reset","","[Version 2.3.0]: 3/24/20","- Added command saving! You can now save/load commands in between servers.","  Use the command box (:cmdbox) or the commands :savec / :runc / :delc (check :cmds for how to use). To run several commands, batch them.","- Fix command box cooldown (now you just have to wait 1 second between each command(s))","- Fixed players being able to get two admin pads","- Added some new commands: r6, r15, and skybox (you can adjust specific sides of the skybox as well) - view :cmds for how to use"]
